Public Member Functions | Friends | List of all members
ACAPI::MEP::v1::TerminalDefault Class Referencefinal
MEP Element Manager
The TerminalDefault contains the necessary non-geometric data for creating a Terminal element. More...
#include <MEPTerminalDefault.hpp>
 Inheritance diagram for ACAPI::MEP::v1::TerminalDefault:
 Public Member Functions
Result< UniqueID >  | Place (const API_Coord3D &coordinate, const Orientation &orientation, const std::optional< API_Guid > &requiredId=std::nullopt) const
Places a Terminal element based on this Default.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Result< ConnectorShape >  | GetShapeOfPort (uint32_t portIdx) const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 void  | RemoveInsulation ()
Removes the insulation.
Result< void >  | SetInsulationThickness (double insulationThickness)
Sets the thickness of insulation on the ElementDefault.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ElementDefault.
 Friends
 class  | Terminal
Result< TerminalDefault >  | CreateTerminalDefault (Domain)
Creates a TerminalDefault.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Modifier (ElementDefault &)
Detailed Description
The TerminalDefault contains the necessary non-geometric data for creating a Terminal element.
Since
Archicad 27
Example code snippet from Test / New MEP
Placement
 {
 auto ductTerminalDefault = CreateTerminalDefault (Domain::Ventilation);
 if (ductTerminalDefault.IsErr ())
 return ductTerminalDefault.UnwrapErr ().kind;
 ACAPI::Result<UniqueID> terminalId = ductTerminalDefault->Place ({ 0.0, 10.0, 0.0 }, { { 1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } }, GSGuid2APIGuid (GS::Guid::GenerateGuid));
 if (terminalId.IsErr ())
 return terminalId.UnwrapErr ().kind;
 ACAPI_WriteReport ("Ventilation Terminal placed successfully", false);
 }
 {
 auto pipeTerminalDefault = CreateTerminalDefault (Domain::Piping);
 if (pipeTerminalDefault.IsErr ())
 return pipeTerminalDefault.UnwrapErr ().kind;
 ACAPI::Result<UniqueID> terminalId = pipeTerminalDefault->Place ({ 10.0, 10.0, 0.0 }, { { 1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } }, GSGuid2APIGuid (GS::Guid::GenerateGuid));
 if (terminalId.IsErr ())
 return terminalId.UnwrapErr ().kind;
 ACAPI_WriteReport ("Piping Terminal placed successfully", false);
 }
Member Function Documentation
◆ Place()
 Result< UniqueID > ACAPI::MEP::v1::TerminalDefault::Place  |  ( |  const API_Coord3D &  |  coordinate,
|  const Orientation &  |  orientation,
|  const std::optional< API_Guid > &  |  requiredId = std::nullopt
) |   |  const
Places a Terminal element based on this Default.
The implementation creates an Undoable Command Scope before executing the placement. This Command Scope is automatically closed after execution. When someone would like to group the placement of several routes and/or MEP elements together, it is recommended to create a single Command Scope. Doing this prevents the opening and closing of a Command Scope for every single created route and/or MEP element, therefore the performance should be improved.
Parameters
coordinate | The coordinate where the Terminal will be placed.
orientation | The orientation of the Terminal, which is based on a direction vector and a rotation vector.
requiredId | The guid to be set for the Terminal - optional parameter
Returns
If executed with success, returns the newly placed Terminal's uniqueId, otherwise Error.
Friends And Related Symbol Documentation
◆ CreateTerminalDefault
 Result< TerminalDefault > CreateTerminalDefault  |  ( |  Domain  |  domain | )
friend
Creates a TerminalDefault.
Parameters
domain | The Domain of the requested TerminalDefault. It can be ventilation or piping.
Returns
If able, returns a copy of Archicad's current Default of the Terminal tool for the domain defined by the parameter, otherwise Error (for ex. if domain is cable carrier).